#0824顺序
import numpy as np
import random
from collections import Counter
import time
out1 = []
#random.seed('20230825') 
my_list1 = ['陈'] * 7004853 + ['黄'] * 5500718 + ['林'] * 5407168 + ['张'] * 3653621 + ['刘'] * 3158899 + ['梁'] * 2943083 + ['吴'] * 2754996 + ['杨'] * 2037085 + ['王'] * 1823554 + ['何'] * 1689346 + ['郑'] * 1627453 + ['罗'] * 1515095 + ['谢'] * 1450037 + ['曾'] * 1395208 + ['钟'] * 1346373 + ['周'] * 1303821 + ['邓'] * 1281773 + ['叶'] * 1216716 + ['蔡'] * 1134744 + ['朱'] * 1016656 + ['冯'] * 933511 + ['许'] * 892919 + ['黎'] * 843303 + ['郭'] * 796275 + ['廖'] * 772519 + ['赖'] * 741261 + ['卢'] * 731120 + ['徐'] * 729505 + ['谭'] * 722963 + ['31-50'] * 10000000 + ['51-100'] * 15000000 + ['机动'] * 10000000
for i in range(0,100):
    out1.append(random.choice(my_list1))
print(out1)
count1 = Counter(out1)
print("列表中每个元素的个数为：", count1)


out2 = []
#random.seed('20230825') 
my_list2 = ['居住'] * 25 + ['工作/学习'] * 47 + ['途径路过'] * 20 + ['？？？'] * 20 
for i in range(0,100):
    out2.append(random.choice(my_list2))
print(out2)
count2 = Counter(out2)
print("列表中每个元素的个数为：", count2)

np1 = np.column_stack((out1, out2))
print(np1)
